Revit 2027 API
IFCExtrusionCreationData.ScaledHeight Property
 The height of the extrusion, scaled to the units of export.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ScaledHeight { get; set; }
Public Property ScaledHeight As Double
	Get
	Set
public:
property double ScaledHeight {
	double get ();
	void set (double value);
}
member ScaledHeight : float with get, set
Property Value
Double
 Zero if the height has never been set on this object.
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace